In [14]:
# Importing liabraries
import mysql.connector
from mysql.connector import Error

In [15]:
# Making connection
conn = mysql.connector.connect(host = "localhost",
                               password = "Tanmay@2002",
                               user = "root",
                               database="sakila")

# Checking Connection
try:
    if conn.is_connected():
        db_info = conn.get_server_info()
        print("You are conneted to MySQL with server",db_info)
except Error as e:
    print("Unable to connect to the MySQL ")

You are conneted to MySQL with server 8.0.26

In [16]:
# Making Cursor Object
cursor = conn.cursor()

### Cross Join (Cartesian Join)

#### Syntax
* SELECT column_name(s)
* FROM table1
* CROSS JOIN table2;

In [21]:
#The CROSS JOIN keyword returns all records from both tables (table1 and table2).
pd.read_sql("""select actor.first_name,actor_info.film_info
                    from actor
                    cross join actor_info;""",conn)

      first_name                                          film_info
0          THORA  Animation: ANACONDA CONFESSIONS; Children: LAN...
1          JULIA  Animation: ANACONDA CONFESSIONS; Children: LAN...
2           MARY  Animation: ANACONDA CONFESSIONS; Children: LAN...
3          REESE  Animation: ANACONDA CONFESSIONS; Children: LAN...
4           BELA  Animation: ANACONDA CONFESSIONS; Children: LAN...
...          ...                                                ...
39995     JOHNNY  Animation: CAROL TEXAS; Children: CHRISTMAS MO...
39996   JENNIFER  Animation: CAROL TEXAS; Children: CHRISTMAS MO...
39997         ED  Animation: CAROL TEXAS; Children: CHRISTMAS MO...
39998       NICK  Animation: CAROL TEXAS; Children: CHRISTMAS MO...
39999   PENELOPE  Animation: CAROL TEXAS; Children: CHRISTMAS MO...

[40000 rows x 2 columns]

## Inner Join
* SELECT column_name(s)
* FROM table1
* INNER JOIN table2
* ON table1.column_name = table2.column_name;
* WHERE condition;

In [24]:
#The INNER JOIN keyword selects records that have matching values in both tables.
pd.read_sql("""select payment.amount,rental.rental_date
                    from payment
                    inner join rental
                    on payment.customer_id = rental.customer_id
                    where amount > 2.99
                    order by amount;
                """,conn)

        amount         rental_date
0         3.98 2005-06-18 21:26:56
1         3.98 2005-06-20 05:15:37
2         3.98 2005-06-20 22:52:18
3         3.98 2005-07-06 02:29:21
4         3.98 2005-07-07 07:26:19
...        ...                 ...
246313   11.99 2005-08-18 17:24:15
246314   11.99 2005-08-19 06:52:58
246315   11.99 2005-08-19 13:12:28
246316   11.99 2005-08-20 08:11:58
246317   11.99 2006-02-14 15:16:03

[246318 rows x 2 columns]

# Left Outer Join
* SELECT column_name(s)
* FROM table1
* LEFT OUTER JOIN table2
* ON table1.column_name = table2.column_name
* WHERE condition;

In [27]:
#The LEFT JOIN keyword returns all records from the left table (table1), and the matching records (if any)
#from the right table (table2).
pd.read_sql("""select film_text.title,film_text.description,film_category.film_id
                        from film_text
                        left outer join film_category
                        on film_text.film_id = film_category.film_id;""",conn)

                 title                                        description  film_id
0     ACADEMY DINOSAUR  A Epic Drama of a Feminist And a Mad Scientist...        1
1       ACE GOLDFINGER  A Astounding Epistle of a Database Administrat...        2
2     ADAPTATION HOLES  A Astounding Reflection of a Lumberjack And a ...        3
3     AFFAIR PREJUDICE  A Fanciful Documentary of a Frisbee And a Lumb...        4
4          AFRICAN EGG  A Fast-Paced Documentary of a Pastry Chef And ...        5
..                 ...                                                ...      ...
995     YOUNG LANGUAGE  A Unbelieveable Yarn of a Boat And a Database ...      996
996         YOUTH KICK  A Touching Drama of a Teacher And a Cat who mu...      997
997       ZHIVAGO CORE  A Fateful Yarn of a Composer And a Man who mus...      998
998  ZOOLANDER FICTION  A Fateful Reflection of a Waitress And a Boat ...      999
999          ZORRO ARK  A Intrepid Panorama of a Mad Scientist And a B...     1000

[1000 rows x 3 columns]

# Right Outer Join
* SELECT column_name(s)
* FROM table1
* RIGHT OUTER JOIN table2
* ON table1.column_name = table2.column_name
* WHERE condition;

In [30]:
#The RIGHT JOIN keyword returns all records from the right table (table2), and the matching records (if any) from the left table (table1).
pd.read_sql("""select film_text.title,film_text.description,film_category.film_id
                        from film_text
                        right outer join film_category
                        on film_text.film_id = film_category.film_id;""",conn)

                   title                                        description  film_id
0           AMADEUS HOLY  A Emotional Display of a Pioneer And a Technic...       19
1        AMERICAN CIRCUS  A Insightful Drama of a Girl And a Astronaut w...       21
2     ANTITRUST TOMATOES  A Fateful Yarn of a Womanizer And a Feminist w...       29
3          ARK RIDGEMONT  A Beautiful Yarn of a Pioneer And a Monkey who...       38
4    BAREFOOT MANCHURIAN  A Intrepid Story of a Cat And a Student who mu...       56
..                   ...                                                ...      ...
995  VALENTINE VANISHING  A Thrilling Display of a Husband And a Butler ...      931
996          WINDOW SIDE  A Astounding Character Study of a Womanizer An...      977
997        WOLVES DESIRE  A Fast-Paced Drama of a Squirrel And a Robot w...      981
998        WORKER TARZAN  A Action-Packed Yarn of a Secret Agent And a T...      988
999  WORKING MICROCOSMOS  A Stunning Epistle of a Dentist And a Dog who ...      989

[1000 rows x 3 columns]

# Full Outer Join
* SELECT column_name(s)
* FROM table1
* FULL OUTER JOIN table2
* ON table1.column_name = table2.column_name
* WHERE condition;